scripts/redis/output.txt
====== PING_INLINE ======
  100000 requests completed in 0.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
13.34% <= 0.2 milliseconds
83.27% <= 0.3 milliseconds
96.47% <= 0.4 milliseconds
99.07% <= 0.5 milliseconds
99.72% <= 0.6 milliseconds
99.89% <= 0.7 milliseconds
99.95% <= 0.8 milliseconds
99.98% <= 0.9 milliseconds
99.98% <= 1.0 milliseconds
100.00% <= 1.1 milliseconds
100.00% <= 1.3 milliseconds
100.00% <= 1.3 milliseconds
119904.08 requests per second

====== PING_BULK ======
  100000 requests completed in 0.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
12.88% <= 0.2 milliseconds
86.74% <= 0.3 milliseconds
97.39% <= 0.4 milliseconds
99.51% <= 0.5 milliseconds
99.83% <= 0.6 milliseconds
99.96% <= 0.7 milliseconds
99.99% <= 0.8 milliseconds
100.00% <= 0.9 milliseconds
119474.31 requests per second

====== SET ======
  100000 requests completed in 0.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
11.20% <= 0.2 milliseconds
84.02% <= 0.3 milliseconds
96.30% <= 0.4 milliseconds
99.40% <= 0.5 milliseconds
99.77% <= 0.6 milliseconds
99.91% <= 0.7 milliseconds
99.94% <= 0.8 milliseconds
99.98% <= 0.9 milliseconds
99.99% <= 1.0 milliseconds
99.99% <= 1.1 milliseconds
100.00% <= 1.1 milliseconds
118343.19 requests per second

====== GET ======
  100000 requests completed in 0.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
12.92% <= 0.2 milliseconds
84.15% <= 0.3 milliseconds
96.98% <= 0.4 milliseconds
99.55% <= 0.5 milliseconds
99.90% <= 0.6 milliseconds
99.96% <= 0.7 milliseconds
99.98% <= 0.8 milliseconds
99.99% <= 0.9 milliseconds
100.00% <= 1.0 milliseconds
100.00% <= 1.0 milliseconds
119904.08 requests per second

====== INCR ======
  100000 requests completed in 0.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
12.11% <= 0.2 milliseconds
84.29% <= 0.3 milliseconds
96.93% <= 0.4 milliseconds
99.41% <= 0.5 milliseconds
99.84% <= 0.6 milliseconds
99.99% <= 0.7 milliseconds
100.00% <= 0.8 milliseconds
119617.22 requests per second

====== LPUSH ======
  100000 requests completed in 0.81 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
11.08% <= 0.2 milliseconds
72.41% <= 0.3 milliseconds
94.10% <= 0.4 milliseconds
99.41% <= 0.5 milliseconds
99.85% <= 0.6 milliseconds
99.99% <= 0.7 milliseconds
100.00% <= 0.8 milliseconds
123152.71 requests per second

====== RPUSH ======
  100000 requests completed in 0.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
13.91% <= 0.2 milliseconds
83.22% <= 0.3 milliseconds
96.89% <= 0.4 milliseconds
99.50% <= 0.5 milliseconds
99.84% <= 0.6 milliseconds
99.98% <= 0.7 milliseconds
100.00% <= 0.8 milliseconds
100.00% <= 0.8 milliseconds
121951.22 requests per second

====== LPOP ======
  100000 requests completed in 0.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
10.81% <= 0.2 milliseconds
78.00% <= 0.3 milliseconds
94.68% <= 0.4 milliseconds
98.98% <= 0.5 milliseconds
99.67% <= 0.6 milliseconds
99.92% <= 0.7 milliseconds
99.96% <= 0.8 milliseconds
99.97% <= 0.9 milliseconds
99.98% <= 1.0 milliseconds
99.99% <= 1.1 milliseconds
100.00% <= 1.2 milliseconds
100.00% <= 1.2 milliseconds
119474.31 requests per second

====== RPOP ======
  100000 requests completed in 0.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
11.21% <= 0.2 milliseconds
75.56% <= 0.3 milliseconds
94.76% <= 0.4 milliseconds
99.18% <= 0.5 milliseconds
99.79% <= 0.6 milliseconds
99.97% <= 0.7 milliseconds
100.00% <= 0.7 milliseconds
121506.68 requests per second

====== SADD ======
  100000 requests completed in 0.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
11.46% <= 0.2 milliseconds
81.33% <= 0.3 milliseconds
96.13% <= 0.4 milliseconds
99.38% <= 0.5 milliseconds
99.83% <= 0.6 milliseconds
99.94% <= 0.7 milliseconds
99.97% <= 0.8 milliseconds
99.99% <= 0.9 milliseconds
100.00% <= 1.0 milliseconds
119904.08 requests per second

====== HSET ======
  100000 requests completed in 0.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
9.50% <= 0.2 milliseconds
72.58% <= 0.3 milliseconds
94.35% <= 0.4 milliseconds
99.16% <= 0.5 milliseconds
99.72% <= 0.6 milliseconds
99.89% <= 0.7 milliseconds
99.98% <= 0.8 milliseconds
100.00% <= 0.9 milliseconds
100.00% <= 1.0 milliseconds
118623.96 requests per second

====== SPOP ======
  100000 requests completed in 0.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
12.75% <= 0.2 milliseconds
87.23% <= 0.3 milliseconds
97.58% <= 0.4 milliseconds
99.52% <= 0.5 milliseconds
99.86% <= 0.6 milliseconds
99.96% <= 0.7 milliseconds
99.99% <= 0.8 milliseconds
99.99% <= 0.9 milliseconds
100.00% <= 1.0 milliseconds
100.00% <= 1.1 milliseconds
120048.02 requests per second

====== ZADD ======
  100000 requests completed in 0.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
9.21% <= 0.2 milliseconds
71.65% <= 0.3 milliseconds
93.81% <= 0.4 milliseconds
99.06% <= 0.5 milliseconds
99.70% <= 0.6 milliseconds
99.87% <= 0.7 milliseconds
99.94% <= 0.8 milliseconds
99.97% <= 0.9 milliseconds
99.99% <= 1.0 milliseconds
100.00% <= 1.1 milliseconds
118906.06 requests per second

====== ZPOPMIN ======
  100000 requests completed in 0.93 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

0.01% <= 0.1 milliseconds
8.79% <= 0.2 milliseconds
70.39% <= 0.3 milliseconds
90.50% <= 0.4 milliseconds
95.56% <= 0.5 milliseconds
97.04% <= 0.6 milliseconds
97.79% <= 0.7 milliseconds
98.23% <= 0.8 milliseconds
98.49% <= 0.9 milliseconds
98.66% <= 1.0 milliseconds
98.74% <= 1.1 milliseconds
98.82% <= 1.2 milliseconds
98.87% <= 1.3 milliseconds
98.93% <= 1.4 milliseconds
98.99% <= 1.5 milliseconds
99.02% <= 1.6 milliseconds
99.05% <= 1.7 milliseconds
99.08% <= 1.8 milliseconds
99.14% <= 1.9 milliseconds
99.22% <= 2 milliseconds
99.90% <= 3 milliseconds
99.95% <= 4 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
107758.62 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 0.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.00% <= 1 milliseconds
99.58% <= 2 milliseconds
99.99% <= 3 milliseconds
100.00% <= 3 milliseconds
111482.72 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 1.47 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

97.18% <= 1 milliseconds
98.61% <= 2 milliseconds
99.11% <= 3 milliseconds
99.65% <= 4 milliseconds
99.87% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 6 milliseconds
68212.83 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 2.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

95.66% <= 1 milliseconds
98.78% <= 2 milliseconds
99.30% <= 3 milliseconds
99.77% <= 4 milliseconds
99.94% <= 5 milliseconds
100.00% <= 5 milliseconds
39292.73 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 3.49 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

86.53% <= 1 milliseconds
98.93% <= 2 milliseconds
99.60% <= 3 milliseconds
99.82% <= 4 milliseconds
99.97% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
28628.69 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 4.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

15.73% <= 1 milliseconds
97.81% <= 2 milliseconds
99.32% <= 3 milliseconds
99.57% <= 4 milliseconds
99.73% <= 5 milliseconds
99.85% <= 6 milliseconds
99.90% <= 7 milliseconds
99.95% <= 8 milliseconds
99.95% <= 11 milliseconds
99.96% <= 12 milliseconds
99.96% <= 14 milliseconds
99.97% <= 15 milliseconds
100.00% <= 15 milliseconds
22563.18 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

99.63% <= 1 milliseconds
99.84% <= 2 milliseconds
99.90% <= 3 milliseconds
100.00% <= 3 milliseconds
99700.90 requests per second